---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ExtraPumpSet
source: html/e02d38b3-ba09-1cba-d355-60ba43e0beb4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ExtraPumpSet Property

More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtraPumpSet { get; }
```